
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПроизвольнымиДанными(Параметры) Экспорт
	
	ПоследнийПорядковыйНомер = ПоследнийПорядковыйНомер(Параметры.ИмяОбъекта);
	
	Сч = 0;
	Пока Сч < Параметры.Количество Цикл
		
		Сч = Сч + 1;
		
		ПоследнийПорядковыйНомер = ПоследнийПорядковыйНомер + 1;
		
		НовыйЭлемент = Справочники[Параметры.ИмяОбъекта].СоздатьЭлемент();
		НовыйЭлемент.ПорядковыйНомер = ПоследнийПорядковыйНомер;
		НовыйЭлемент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПоследнийПорядковыйНомер(ИмяТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Таблица.ПорядковыйНомер), 0) КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.&ИмяТаблицы КАК Таблица";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПорядковыйНомер;
	
КонецФункции

Процедура УстановитьНаименованиеСПорядковымНомером(Объект, ИмяОбъекта) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Объект.ПорядковыйНомер) Тогда
			Объект.Наименование = СтрШаблон("%1 %2", ИмяОбъекта, Объект.ПорядковыйНомер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
