
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяОбъекта = Неопределено;
	
	Если СтрНайти(ПараметрыВыполненияКоманды.источник.ИмяФормы, "Номенклатура") <> 0 Тогда
		ИмяОбъекта = "Номенклатура";
	Иначе
		ВызватьИсключение НСтр("ru = 'Не поддерживается'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяОбъекта", ИмяОбъекта);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводЧисла(Оповещение, 0, НСтр("ru = 'Сколько?'"), 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяОбъекта", ДополнительныеПараметры.ИмяОбъекта);
	Параметры.Вставить("Количество", Результат);
	
	ЗаполнениеПроизвольнымиДаннымиВызовСервера.ЗаполнитьПроизвольнымиДанными(Параметры);
	
	ОповеститьОбИзменении(ПредопределенноеЗначение("Справочник." + ДополнительныеПараметры.ИмяОбъекта + ".ПустаяСсылка"));
	
КонецПроцедуры